<!DOCTYPE html><html lang="zh-cn"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="description" content="this is a blog"><meta name="viewport" content="width=device-width, initial-scale=1"><title>传输控制协议（3）拥塞控制 · gzmviavia</title><link rel="short icon" href="/favicon.ico"><!-- font--><link rel="stylesheet" href="//fonts.googleapis.com/css?family=Source+Sans+Pro:400,600|Roboto Mono"><!-- icon--><link rel="stylesheet" href="/fonts/iconfont/iconfont.css"><!-- theme style--><link rel="stylesheet" href="/css/style.css"><!-- baidu analytics--><script type="text/javascript">var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?9e0cbea7d3319c6c94c71dfb93c151b8";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script><!-- google analytics--><script type="text/javascript">(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74273646-1', 'auto');
ga('send', 'pageview');</script></head><body><div id="main"><header><a href="/." class="logo">gzmviavia</a><ul class="nav"><li class="nav-link"><a href="/" target="_self">首页</a></li><li class="nav-link"><a href="/archives/" target="_self">归档</a></li><li class="nav-link"><a href="/categories/" target="_self">分类</a></li><li class="nav-link"><a href="/tags/" target="_self">标签</a></li><li class="nav-link"><a href="/about/" target="_self">关于</a></li></ul></header><section id="container"><article class="post"><h1 class="post-title">传输控制协议（3）拥塞控制</h1><span class="post-time">2016年8月12日</span><div id="sidebar" class="post-sidebar"><h3 class="heading">目录</h3><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#慢开始和拥塞避免"><span class="toc-text">慢开始和拥塞避免</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#慢开始算法"><span class="toc-text">慢开始算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#拥塞避免算法"><span class="toc-text">拥塞避免算法</span></a></li></ol></li><li class="toc-item toc-level-2"><a class="toc-link" href="#快重传和快恢复"><span class="toc-text">快重传和快恢复</span></a></li></ol></div><div class="post-content"><blockquote>
<p>&#x6240;&#x8C13;&#x62E5;&#x585E;&#x63A7;&#x5236;&#xFF0C;&#x5C31;&#x662F;&#x9632;&#x6B62;&#x8FC7;&#x591A;&#x7684;&#x6570;&#x636E;&#x6CE8;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x548C;&#x94FE;&#x8DEF;&#x4E0D;&#x81F3;&#x4E8E;&#x8FC7;&#x8F7D;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<strong>&#x5168;&#x5C40;&#x6027;&#x7684;&#x8FC7;&#x7A0B;</strong>&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E3B;&#x673A;&#x90FD;&#x5FC5;&#x987B;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x8425;&#x9020;&#x4E00;&#x4E2A;&#x66F4;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x3002;</p>
</blockquote>
<a id="more"></a>
<p>4&#x79CD;&#x7528;&#x4E8E;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;&#x6162;&#x5F00;&#x59CB;(slow-start)&#x3001;&#x62E5;&#x585E;&#x907F;&#x514D;(congestion avoidance)&#x3001;&#x5FEB;&#x91CD;&#x4F20;(fast retransmit)&#x3001;&#x5FEB;&#x6062;&#x590D;(fast recovery)&#x3002;</p>
<h2 id="&#x6162;&#x5F00;&#x59CB;&#x548C;&#x62E5;&#x585E;&#x907F;&#x514D;"><a href="#&#x6162;&#x5F00;&#x59CB;&#x548C;&#x62E5;&#x585E;&#x907F;&#x514D;" class="headerlink" title="&#x6162;&#x5F00;&#x59CB;&#x548C;&#x62E5;&#x585E;&#x907F;&#x514D;"></a>&#x6162;&#x5F00;&#x59CB;&#x548C;&#x62E5;&#x585E;&#x907F;&#x514D;</h2><p>&#x53D1;&#x9001;&#x65B9;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;<strong>&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd</strong>&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;rwnd&#x548C;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;cwnd&#xFF0C;<strong>&#x53D1;&#x9001;&#x65B9;&#x7A97;&#x53E3;&#x5927;&#x5C0F; = min{ rwnd , cwnd }</strong>;</p>
<p>&#x53D1;&#x9001;&#x65B9;&#x63A7;&#x5236;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x5927;&#x5C0F;&#x7684;&#x539F;&#x5219;&#x662F;&#xFF1A;<strong>&#x53EA;&#x8981;&#x7F51;&#x7EDC;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#xFF0C;&#x90A3;&#x4E48;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x5C31;&#x518D;&#x589E;&#x5927;&#x4E00;&#x4E9B;</strong>&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x66F4;&#x591A;&#x7684;&#x5206;&#x7EC4;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF1B;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x4E86;&#x62E5;&#x585E;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F7F;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x51CF;&#x5C0F;&#x4E00;&#x4E9B;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x6CE8;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5206;&#x7EC4;&#x6570;&#x3002;&#x81F3;&#x4E8E;&#x5982;&#x4F55;&#x589E;&#x5927;&#x548C;&#x51CF;&#x5C0F;&#x770B;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;"><a href="#&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;" class="headerlink" title="&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;"></a>&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;</h3><blockquote>
<p>&#x5F53;&#x4E3B;&#x673A;&#x521A;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5C1A;&#x4E0D;&#x6E05;&#x695A;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x5B9C;&#x4E00;&#x4E0B;&#x5B50;&#x53D1;&#x9001;&#x592A;&#x591A;&#x6570;&#x636E;&#x51FA;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x6162;&#x6162;&#x8BD5;&#x63A2;&#x80FD;&#x591F;&#x53D1;&#x9001;&#x591A;&#x5C11;&#x6570;&#x636E;&#x3002;&#x6240;&#x4EE5;&#x5148;&#x8BA9;cwnd = 1 * MSS&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x6BCF;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x65B0;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x786E;&#x8BA4;&#xFF08;&#x5BF9;&#x4E8E;&#x91CD;&#x4F20;&#x62A5;&#x6587;&#x7684;&#x786E;&#x8BA4;&#x4E0D;&#x7B97;&#x5728;&#x5185;&#xFF09;&#x5C31;&#x5C06;cwnd += MSS&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x5728;&#x4E0D;&#x53D1;&#x751F;&#x91CD;&#x4F20;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;RTT&#xFF0C;cwnd&#x7684;&#x503C;&#x5C31;&#x4F1A;&#x52A0;&#x500D;&#x3002;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x63A2;&#x6D4B;&#x89C2;&#x5BDF;&#xFF0C;&#x4F7F;&#x5F97;&#x65B0;&#x5206;&#x7EC4;&#x8FDB;&#x5165;&#x7F51;&#x7EDC;&#x7684;&#x901F;&#x7387;&#x5E94;&#x8BE5;&#x4E0E;&#x53E6;&#x4E00;&#x65B9;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x7684;&#x901F;&#x7387;&#x76F8;&#x540C;&#x3002;</p>
</blockquote>
<p></p><p style="color:blue"><br>&#x5F00;&#x59CB;    &#x2014;&gt;        cwnd = 1 * MSS<br>&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;RTT &#x2014;&gt;    cwnd = 2 * MSS<br>&#x7ECF;&#x8FC7;&#x4E8C;&#x4E2A;RTT &#x2014;&gt;    cwnd = 4 * MSS<br>&#x7ECF;&#x8FC7;&#x4E09;&#x4E2A;RTT    &#x2014;&gt;    cwnd = 8 * MSS<br>&#x2026;.<br></p><br><img src="/2016/08/12/transmission-control-protocol3/slow-start.png" alt="slow-start"><p></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x662F;&#x6307;cwnd&#x7684;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x6162;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x4E3B;&#x673A;&#x521A;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EA;&#x80FD;&#x591F;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#xFF08;&#x76EE;&#x7684;&#x662F;&#x8BD5;&#x63A2;&#x4E00;&#x4E0B;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x585E;&#x60C5;&#x51B5;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x7684;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x592A;&#x5FEB;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x9632;&#x6B62;cwnd&#x589E;&#x957F;&#x8FC7;&#x5FEB;&#x800C;&#x5F15;&#x8D77;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x8FD8;&#x9700;&#x8981;&#x7528;&#x5230;<strong>&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;</strong>&#x3002;</p>
<h3 id="&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;"><a href="#&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;" class="headerlink" title="&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;"></a>&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;</h3><p>&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x4F7F;&#x5F97;cwnd&#x589E;&#x957F;&#x975E;&#x5E38;&#x8FC5;&#x901F;&#xFF0C;&#x4ECE;&#x800C;&#x5BB9;&#x6613;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;<strong>&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650;ssthresh</strong>&#xFF0C;&#x5F53;cwnd&#x5927;&#x4E8E;ssthresh&#x65F6;&#xFF0C;&#x5C31;&#x8BA9;&#x5176;&#x589E;&#x957F;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x8FC5;&#x901F;&#x3002;&#x5177;&#x4F53;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5F53;cwnd &lt; ssthresh&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;</li>
<li>&#x5F53;cwnd &gt; ssthresh&#x65F6;&#xFF0C;&#x505C;&#x6B62;&#x4F7F;&#x7528;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x6539;&#x7528;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x3002;</li>
<li>&#x5F53;cwnd = ssthresh&#x65F6;&#xFF0C;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x53C8;&#x53EF;&#x4F7F;&#x7528;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x3002;</li>
</ul>
<blockquote>
<p>&#x62E5;&#x585E;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x8BA9;cwnd&#x7F13;&#x6162;&#x589E;&#x5927;&#xFF0C;&#x5373;&#x6BCF;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;RTT&#xFF0C;cwnd&#x7684;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x4E00;&#x4E2A;MSS&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x90A3;&#x6837;&#x52A0;&#x500D;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x4E0B;&#x56FE;&#x5F53;cwnd &lt; ssthresh&#x65F6;&#xFF0C;cwnd&#x7684;&#x589E;&#x957F;&#x975E;&#x5E38;&#x8FC5;&#x901F;&#xFF1B; &#x5F53;cwnd &gt;= ssthresh&#x65F6;&#xFF0C;cwnd&#x5C31;&#x4EE5;&#x7EBF;&#x6027;&#x7684;&#x65B9;&#x5F0F;&#x589E;&#x52A0;&#x4E86;&#x3002;</p>
<p><img src="/2016/08/12/transmission-control-protocol3/slow-start-and-ssthresh.png" alt="&#x6162;&#x542F;&#x52A8;&#x548C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x4E3E;&#x4F8B;"></p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6162;&#x5F00;&#x59CB;&#x9636;&#x6BB5;&#x8FD8;&#x662F;&#x5728;&#x62E5;&#x585E;&#x907F;&#x514D;&#x9636;&#x6BB5;&#xFF0C;&#x53EA;&#x8981;&#x53D1;&#x9001;&#x65B9;&#x5224;&#x65AD;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x4E86;&#x62E5;&#x585E;&#xFF08;&#x5373;&#x53D1;&#x73B0;&#x6709;&#x62A5;&#x6587;&#x6CA1;&#x6709;&#x6309;&#x65F6;&#x6536;&#x5230;&#x786E;&#x8BA4;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5C06;&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650;&#x8BBE;&#x4E3A;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x65F6;&#x53D1;&#x9001;&#x53D1;&#x7A97;&#x53E3;&#x503C;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8BA9;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd = 1 * MSS&#xFF0C;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8FC5;&#x901F;&#x51CF;&#x5C11;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5206;&#x7EC4;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x53D1;&#x751F;&#x62E5;&#x585E;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x628A;&#x961F;&#x5217;&#x4E2D;&#x79EF;&#x538B;&#x7684;&#x5206;&#x7EC4;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#x5408;&#x8D77;&#x6765;<strong>&#x52A0;&#x6CD5;&#x589E;&#x5927;&#x4E58;&#x6CD5;&#x51CF;&#x5C0F;</strong>AIMD&#xFF08;Additive Increase Multiplicative Decrease&#xFF09;&#x3002; <strong>&#x4E58;&#x6CD5;&#x51CF;&#x5C0F;</strong>&#x5373;&#x4E0D;&#x7BA1;&#x5728;&#x6162;&#x5F00;&#x59CB;&#x8FD8;&#x662F;&#x5728;&#x62E5;&#x585E;&#x907F;&#x514D;&#x9636;&#x6BB5;&#xFF0C;&#x53EA;&#x8981;&#x4E00;&#x53D1;&#x751F;&#x62E5;&#x585E;&#xFF0C;&#x5C31;&#x628A;&#x6162;&#x542F;&#x52A8;&#x95E8;&#x9650;ssthresh&#x51CF;&#x534A;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x7F51;&#x7EDC;&#x7E41;&#x5FD9;&#x65F6;ssthresh&#x4E0B;&#x964D;&#x5F97;&#x8FD8;&#x5FEB;&#xFF0C;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x6CE8;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5206;&#x7EC4;&#x6570;&#x3002; <strong>&#x52A0;&#x6CD5;&#x589E;&#x5927;</strong>&#x662F;&#x6307;&#x5728;&#x62E5;&#x585E;&#x907F;&#x514D;&#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x7528;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7F13;&#x6162;&#x589E;&#x52A0;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x7F51;&#x7EDC;&#x8FC7;&#x65E9;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x3002;</p>
<h2 id="&#x5FEB;&#x91CD;&#x4F20;&#x548C;&#x5FEB;&#x6062;&#x590D;"><a href="#&#x5FEB;&#x91CD;&#x4F20;&#x548C;&#x5FEB;&#x6062;&#x590D;" class="headerlink" title="&#x5FEB;&#x91CD;&#x4F20;&#x548C;&#x5FEB;&#x6062;&#x590D;"></a>&#x5FEB;&#x91CD;&#x4F20;&#x548C;&#x5FEB;&#x6062;&#x590D;</h2><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;TCP&#x4F1A;&#x5728;&#x67D0;&#x4E2A;&#x5206;&#x7EC4;&#x7684;<strong>&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;</strong>&#x5230;&#x671F;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x91CD;&#x4F20;&#x8BE5;&#x5206;&#x7EC4;&#x3002;&#x800C;<strong>&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;</strong>&#x5219;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#x3002;<br>&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;&#x6BCF;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x5931;&#x5E8F;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#x5C31;&#x7ACB;&#x5373;&#x53D1;&#x51FA;&#x91CD;&#x590D;&#x786E;&#x8BA4;&#xFF0C;&#x8BE5;&#x91CD;&#x590D;&#x786E;&#x8BA4;&#x662F;&#x5BF9;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x786E;&#x8BA4;&#x3002;<br>&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x5F53;&#x6536;&#x5230;&#x5931;&#x5E8F;&#x7684;M4,M5,M6&#x65F6;&#xFF0C;&#x90FD;&#x5BF9;M2&#x8FDB;&#x884C;&#x4E86;&#x91CD;&#x590D;&#x786E;&#x8BA4;&#xFF0C;&#x8FD9;&#x8868;&#x793A;&#x6709;&#x62A5;&#x6587;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x53D1;&#x9001;&#x65B9;&#x7ACB;&#x5373;&#x91CD;&#x4F20;&#x4E22;&#x5931;&#x7684;&#x62A5;&#x6587;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x8FC7;&#x671F;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;&#x3002;</p>
<p><img src="/2016/08/12/transmission-control-protocol3/fast_retransmit.png" alt="&#x5FEB;&#x91CD;&#x4F20;"></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6267;&#x884C;&#x7684;&#x4E0D;&#x662F;&#x6162;&#x542F;&#x52A8;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x5C31;&#x53EB;&#x505A;&#x5FEB;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#x3002;</p>
<ol>
<li>&#x5F53;&#x6536;&#x5230;3&#x4E2A;&#x91CD;&#x590D;&#x7684;ACK&#x62A5;&#x6587;&#x65F6;&#xFF0C;&#x5C06;ssthresh&#x8BBE;&#x7F6E;&#x5F53;&#x524D;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x7684;&#x4E00;&#x534A;&#x3002;&#x91CD;&#x4F20;&#x4E22;&#x5931;&#x7684;&#x62A5;&#x6587;&#x3002;&#x51CF;&#x4F4E;ssthresh&#x662F;<strong>&#x9632;&#x6B62;</strong>&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x3002;</li>
<li>&#x53C8;&#x7531;&#x4E8E;&#x8FDE;&#x7EED;&#x6536;&#x5230;3&#x4E2A;&#x91CD;&#x590D;&#x7684;ACK&#x62A5;&#x6587;&#xFF0C;&#x8BF4;&#x660E;&#x7F51;&#x7EDC;<strong>&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x62E5;&#x585E;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x8BA9;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd = ssthresh&#xFF0C;&#x968F;&#x540E;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x3002;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x63CF;&#x8FF0;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x5FEB;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x53EA;&#x6709;&#x5728;TCP&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x548C;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x8FC7;&#x671F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;&#x91C7;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x62A5;&#x6587;&#x4E22;&#x5931;&#x65F6;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x91CD;&#x4F20;&#xFF0C;&#x800C;&#x4E14;&#x907F;&#x514D;&#x4E86;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x4E86;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x3002;</p>
</div></article><div class="tags"><a href="/tags/运输层/">运输层</a><a href="/tags/TCP/">TCP</a></div><div class="paginator"><a href="/2016/08/13/transmission-control-protocol4/" class="prev"><i class="iconfont icon-left"></i><span> 上一页</span></a><a href="/2016/08/11/transmission-control-protocol2/" class="next"><span>下一页</span><i class="iconfont icon-right"></i></a></div><section id="comments"><div id="disqus_thread"></div></section><script type="text/javascript">(function() {
var d = document, s = d.createElement('script');

s.src = '//ahonn.disqus.com/embed.js';

s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script></section><footer><div class="copyright"><p>&copy;2016<span class="heart"><i class="iconfont icon-heart"></i></span><span class="author">gzmviavia</span></p><p class="theme">Theme by <a href="https://github.com/ahonn/hexo-theme-even"> Even</a></p></div><label id="back2top"><i class="iconfont icon-up"></i></label></footer></div></body><script src="/js/zepto.min.js"></script><script src="/js/theme.js"></script></html>