<!DOCTYPE html><html lang="zh-cn"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="description" content="this is a blog"><meta name="viewport" content="width=device-width, initial-scale=1"><title>传输控制协议（2）可靠传输 · gzmviavia</title><link rel="short icon" href="/favicon.ico"><!-- font--><link rel="stylesheet" href="//fonts.googleapis.com/css?family=Source+Sans+Pro:400,600|Roboto Mono"><!-- icon--><link rel="stylesheet" href="/fonts/iconfont/iconfont.css"><!-- theme style--><link rel="stylesheet" href="/css/style.css"><!-- baidu analytics--><script type="text/javascript">var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?9e0cbea7d3319c6c94c71dfb93c151b8";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script><!-- google analytics--><script type="text/javascript">(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74273646-1', 'auto');
ga('send', 'pageview');</script></head><body><div id="main"><header><a href="/." class="logo">gzmviavia</a><ul class="nav"><li class="nav-link"><a href="/" target="_self">首页</a></li><li class="nav-link"><a href="/archives/" target="_self">归档</a></li><li class="nav-link"><a href="/categories/" target="_self">分类</a></li><li class="nav-link"><a href="/tags/" target="_self">标签</a></li><li class="nav-link"><a href="/about/" target="_self">关于</a></li></ul></header><section id="container"><article class="post"><h1 class="post-title">传输控制协议（2）可靠传输</h1><span class="post-time">2016年8月11日</span><div id="sidebar" class="post-sidebar"><h3 class="heading">目录</h3><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#TCP如何保证可靠传输"><span class="toc-text">TCP如何保证可靠传输</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#超时重传"><span class="toc-text">超时重传</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#停止等待ARQ协议"><span class="toc-text">停止等待ARQ协议</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#回退n帧ARQ协议"><span class="toc-text">回退n帧ARQ协议</span></a></li></ol></li><li class="toc-item toc-level-2"><a class="toc-link" href="#流量控制"><span class="toc-text">流量控制</span></a></li></ol></div><div class="post-content"><h2 id="TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;"><a href="#TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;" class="headerlink" title="TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;"></a>TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;</h2><p>&#x8981;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x4FDD;&#x8BC1;&#x4E0B;&#x9762;&#x8FD9;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x6210;&#x7ACB;</p>
<ol>
<li>&#x4F20;&#x8F93;&#x4FE1;&#x9053;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5DEE;&#x9519;</li>
<li>&#x4E0D;&#x7BA1;&#x53D1;&#x9001;&#x65B9;&#x4EE5;&#x591A;&#x5FEB;&#x7684;&#x901F;&#x7387;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x603B;&#x662F;&#x6765;&#x5F97;&#x5373;&#x5904;&#x7406;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x3002;</li>
</ol>
<a id="more"></a>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x662F;&#x4E0D;&#x4F1A;&#x6210;&#x7ACB;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x534F;&#x8BAE;&#xFF0C;&#x4F7F;&#x5F97;</p>
<ol>
<li>&#x5F53;&#x51FA;&#x73B0;&#x5DEE;&#x9519;&#x65F6;&#xFF0C;&#x8BA9;&#x53D1;&#x9001;&#x65B9;&#x91CD;&#x4F20;&#x51FA;&#x73B0;&#x5DEE;&#x9519;&#x7684;&#x6570;&#x636E;&#x3002; &#x7B80;&#x5355;&#x5F97;&#x6765;&#x8BF4;&#x5C31;&#x662F;<strong>&#x8D85;&#x65F6;&#x91CD;&#x4F20;</strong>&#x3002;</li>
<li>&#x63A5;&#x6536;&#x65B9;&#x6765;&#x4E0D;&#x53CA;&#x5904;&#x7406;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53CA;&#x65F6;&#x544A;&#x8BC9;&#x53D1;&#x9001;&#x65B9;&#x9002;&#x5F53;&#x964D;&#x4F4E;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#x3002;  &#x7B80;&#x5355;&#x5F97;&#x6765;&#x8BF4;&#x5C31;&#x662F;<strong>&#x6D41;&#x91CF;&#x63A7;&#x5236;</strong>&#x3002;</li>
</ol>
<h2 id="&#x8D85;&#x65F6;&#x91CD;&#x4F20;"><a href="#&#x8D85;&#x65F6;&#x91CD;&#x4F20;" class="headerlink" title="&#x8D85;&#x65F6;&#x91CD;&#x4F20;"></a>&#x8D85;&#x65F6;&#x91CD;&#x4F20;</h2><p>TCP&#x8981;&#x6C42;&#x63A5;&#x6536;&#x65B9;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x3002;<br>TCP&#x4F1A;&#x5BF9;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x7684;&#x5206;&#x7EC4;&#x542F;&#x52A8;&#x4E00;&#x4E2A;<strong>&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;</strong>&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x5230;&#x671F;&#x4E4B;&#x524D;&#x6536;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x64A4;&#x9500;&#x8BA1;&#x65F6;&#x5668;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x5230;&#x671F;&#x4E4B;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5C31;&#x4F1A;&#x91CD;&#x53D1;&#x8BE5;&#x5206;&#x7EC4;&#x3002;&#x6240;&#x4EE5;</p>
<ul>
<li>&#x53D1;&#x9001;&#x65B9;&#x5FC5;&#x987B;&#x4FDD;&#x7559;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x5206;&#x7EC4;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x76F4;&#x5230;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x53D1;&#x6765;&#x7684;&#x5BF9;&#x4E8E;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x624D;&#x80FD;&#x591F;&#x4E22;&#x5F03;&#x8BE5;&#x62A5;&#x6587;&#x3002;</li>
<li>&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x8BBE;&#x7F6E;&#x7684;&#x91CD;&#x4F20;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x6BD4;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x7684;<strong>&#x5E73;&#x5747;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;</strong>&#x66F4;&#x957F;&#x4E00;&#x4E9B;&#x3002;&#x8BE5;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x9009;&#x62E9;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B9A;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x81EA;&#x9002;&#x5E94;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x81EA;&#x52A8;&#x91CD;&#x4F20;&#x5206;&#x7EC4;&#x7684;&#x534F;&#x8BAE;&#x6210;&#x4E3A;ARQ(Automatic Repeat reQuset)&#x534F;&#x8BAE;&#xFF0C;&#x5373;&#x63A5;&#x6536;&#x65B9;&#x4E0D;&#x7528;&#x8BF7;&#x95EE;&#x53D1;&#x9001;&#x65B9;&#x91CD;&#x4F20;&#x67D0;&#x4E2A;&#x51FA;&#x9519;&#x7684;&#x5206;&#x7EC4;&#x3002;</p>
<p><strong>ARP&#x534F;&#x8BAE;&#x5206;&#x4E3A;&#x505C;&#x6B62;&#x7B49;&#x5F85;(stop-and-wait)ARQ&#x3001;&#x56DE;&#x9000;n&#x5E27;(go-back-n)ARQ&#x3001;&#x9009;&#x62E9;&#x6027;&#x91CD;&#x4F20;(selective repeat)ARQ&#x3002;</strong></p>
<p>&#x540E;&#x4E24;&#x79CD;ARQ&#x53C8;&#x53EB;&#x505A;&#x8FDE;&#x7EED;ARQ&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x4E24;&#x79CD;ARQ&#x5141;&#x8BB8;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x8FDE;&#x7EED;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x5206;&#x7EC4;&#x3002;</p>
<h3 id="&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;"><a href="#&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;" class="headerlink" title="&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;"></a>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;</h3><p>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;&#x5982;&#x4E0B;&#x56FE;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;A&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x7ED9;B&#xFF0C;&#x5982;&#x679C;A&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;B&#x5BF9;&#x4E8E;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x4F1A;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6536;&#x5230;&#x4E86;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x91CD;&#x4F20;&#x8BE5;&#x5206;&#x7EC4;&#x3002;</p>
<p><img src="/2016/08/11/transmission-control-protocol2/stop_waitting_protocol.png" alt="&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;"></p>
<p>&#x5982;&#x679C;B&#x6536;&#x5230;&#x4E86;A&#x53D1;&#x9001;&#x7684;&#x62A5;&#x6587;M1&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x9001;&#x4E86;&#x5BF9;M1&#x62A5;&#x6587;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E22;&#x5931;&#x4E86;&#x6216;&#x8005;&#x8FDF;&#x5230;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;</p>
<ul>
<li>&#x786E;&#x8BA4;&#x4E22;&#x5931;&#xFF1A;&#x90A3;&#x4E48;A&#x4F1A;&#x91CD;&#x4F20;&#x62A5;&#x6587;M1&#xFF0C;B&#x63A5;&#x6536;&#x5230;M1&#x540E;&#x5C31;&#x77E5;&#x9053;A&#x6CA1;&#x6709;&#x6536;&#x5230;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x91CD;&#x53D1;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x7684;M1&#x5206;&#x7EC4;&#x3002;</li>
<li>&#x786E;&#x8BA4;&#x8FDF;&#x5230;&#xFF1A;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x7684;&#x671F;&#x9650;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x5BF9;&#x62A5;&#x6587;M1&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;A&#x4F1A;&#x91CD;&#x4F20;&#x62A5;&#x6587;M1&#xFF0C;B&#x63A5;&#x6536;&#x5230;M1&#x540E;&#x5C31;&#x77E5;&#x9053;A&#x6CA1;&#x6709;&#x6536;&#x5230;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x91CD;&#x53D1;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x7684;M1&#x62A5;&#x6587;&#x3002;&#x90A3;&#x4E48;A&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x5230;&#x4E24;&#x4E2A;&#x5BF9;M1&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;A&#x53EA;&#x8981;&#x4E22;&#x5F03;&#x91CD;&#x590D;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x5373;&#x53EF;&#x3002;</li>
</ul>
<p><img src="/2016/08/11/transmission-control-protocol2/verify_lost_and_verify_late.png" alt="&#x786E;&#x8BA4;&#x4E22;&#x5931;&#x548C;&#x786E;&#x8BA4;&#x8FDF;&#x5230;"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#x53D1;&#x9001;&#x6548;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD0;&#x8F93;&#x5C42;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E2A;&#x8FD9;&#x662F;&#x5F15;&#x51FA;&#x5982;&#x679C;&#x4FDD;&#x8BC1;&#x6700;&#x7B80;&#x5355;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x8981;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"><a href="#&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;" class="headerlink" title="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"></a>&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;</h3><p>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x6BCF;&#x6B21;&#x53EA;&#x80FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#x3002;&#x800C;&#x56DE;&#x9000;n&#x5E27;&#x5141;&#x8BB8;&#x63A5;&#x6536;&#x65B9;&#x6BCF;&#x6B21;&#x53D1;&#x9001;&#x8FDE;&#x7EED;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7684;&#x539F;&#x7406;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#xFF0C;&#x5728;&#x8BE5;&#x7A97;&#x53E3;&#x5185;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x53EF;&#x4EE5;&#x8FDE;&#x7EED;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x6BCF;&#x6536;&#x5230;&#x7A97;&#x53E3;&#x6700;&#x5DE6;&#x8FB9;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x7A97;&#x53E3;&#x5F80;&#x53F3;&#x79FB;&#x52A8;&#x3002;&#x5982;&#x679C;&#x539F;&#x6765;&#x53D1;&#x9001;&#x4E86;&#x8FDE;&#x7EED;&#x7684;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x7B2C;6&#x4E2A;&#x5206;&#x7EC4;&#x4E86;&#x3002;</p>
<p><img src="/2016/08/11/transmission-control-protocol2/go_back_n.png" alt="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"></p>
<p>&#x63A5;&#x6536;&#x65B9;&#x4E00;&#x822C;&#x662F;&#x91C7;&#x7528;<strong>&#x7D2F;&#x79EF;&#x786E;&#x8BA4;</strong>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x63A5;&#x6536;&#x65B9;&#x6CA1;&#x5FC5;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x63A5;&#x6536;&#x5230;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x6536;&#x5230;&#x51E0;&#x4E2A;&#x5206;&#x7EC4;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x6309;&#x5E8F;&#x5230;&#x8FBE;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#x3002;&#x8FD9;&#x5C31;&#x8868;&#x793A;&#x5230;&#x8FD9;&#x4E2A;&#x5206;&#x7EC4;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x6B63;&#x786E;&#x6536;&#x5230;&#x4E86;&#x3002;</p>
<p><strong>&#x7D2F;&#x79EF;&#x786E;&#x8BA4;</strong>&#x4E5F;&#x662F;&#x6709;&#x7F3A;&#x70B9;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x9001;&#x65B9;&#x53D1;&#x9001;&#x4E86;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x95F4;&#x7684;&#x7B2C;3&#x4E2A;&#x5206;&#x7EC4;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x6536;&#x65B9;&#x53EA;&#x80FD;&#x5BF9;&#x7B2C;2&#x4E2A;&#x5206;&#x7EC4;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x8868;&#x793A;&#x7B2C;1&#x4E2A;&#x548C;&#x7B2C;2&#x4E2A;&#x5206;&#x7EC4;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x3002;&#x6B64;&#x65F6;&#x867D;&#x7136;&#x63A5;&#x6536;&#x65B9;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x7B2C;4&#x4E2A;&#x548C;&#x7B2C;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x9001;&#x65B9;&#x4ECD;&#x65E7;&#x4F1A;&#x91CD;&#x4F20;&#x7B2C;3&#x3001;4&#x3001;5&#x4E2A;&#x5206;&#x7EC4;&#x3002;&#x8FD9;&#x5C31;&#x53EB;&#x505A;go-back-n&#xFF0C;&#x8868;&#x793A;&#x9700;&#x8981;&#x518D;&#x9000;&#x56DE;&#x6765;&#x91CD;&#x4F20;&#x5DF2;&#x7ECF;&#x53D1;&#x9001;&#x8FC7;&#x7684;n&#x4E2A;&#x5206;&#x7EC4;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;TCP/IP&#x534F;&#x8BAE;&#x597D;&#x50CF;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;"><a href="#&#x6D41;&#x91CF;&#x63A7;&#x5236;" class="headerlink" title="&#x6D41;&#x91CF;&#x63A7;&#x5236;"></a>&#x6D41;&#x91CF;&#x63A7;&#x5236;</h2><p>&#x5728;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x8D8A;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x80FD;&#x591F;&#x5728;&#x6536;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#x8FDE;&#x7EED;&#x53D1;&#x9001;&#x66F4;&#x591A;&#x7684;&#x5206;&#x7EC4;&#x3002;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x3002;<br>&#x4F46;&#x662F;&#x5982;&#x679C;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x53D1;&#x9001;&#x901F;&#x5EA6;&#x8FC7;&#x5FEB;&#xFF0C;&#x5BFC;&#x81F4;&#x63A5;&#x6536;&#x65B9;&#x6765;&#x4E0D;&#x53CA;&#x63A5;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F46;&#x6CA1;&#x6709;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x4F1A;&#x6D6A;&#x8D39;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF0C;&#x5373;&#x8BA9;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x53D1;&#x9001;&#x901F;&#x7387;&#x4E0D;&#x8981;&#x592A;&#x5FEB;&#xFF0C;&#x8981;&#x8BA9;&#x63A5;&#x6536;&#x65B9;&#x6765;&#x7684;&#x53CA;&#x63A5;&#x6536;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="http://blog.csdn.net/jmq_0000/article/details/7299910" target="_blank" rel="external">ARQ&#x4E0E;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;</a></li>
</ul>
</div></article><div class="tags"><a href="/tags/运输层/">运输层</a><a href="/tags/TCP/">TCP</a></div><div class="paginator"><a href="/2016/08/10/transmission-control-protocol1/" class="next"><span>下一页</span><i class="iconfont icon-right"></i></a></div><section id="comments"><div id="disqus_thread"></div></section><script type="text/javascript">(function() {
var d = document, s = d.createElement('script');

s.src = '//ahonn.disqus.com/embed.js';

s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script></section><footer><div class="copyright"><p>&copy;2016<span class="heart"><i class="iconfont icon-heart"></i></span><span class="author">gzmviavia</span></p><p class="theme">Theme by <a href="https://github.com/ahonn/hexo-theme-even"> Even</a></p></div><label id="back2top"><i class="iconfont icon-up"></i></label></footer></div></body><script src="/js/zepto.min.js"></script><script src="/js/theme.js"></script></html>