<!DOCTYPE html><html lang="zh-cn"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="description" content="this is a blog"><meta name="viewport" content="width=device-width, initial-scale=1"><title>传输控制协议（2）可靠传输 · gzmviavia</title><link rel="short icon" href="/favicon.ico"><!-- font--><link rel="stylesheet" href="//fonts.googleapis.com/css?family=Source+Sans+Pro:400,600|Roboto Mono"><!-- icon--><link rel="stylesheet" href="/fonts/iconfont/iconfont.css"><!-- theme style--><link rel="stylesheet" href="/css/style.css"><!-- baidu analytics--><script type="text/javascript">var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?9e0cbea7d3319c6c94c71dfb93c151b8";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script><!-- google analytics--><script type="text/javascript">(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74273646-1', 'auto');
ga('send', 'pageview');</script></head><body><div id="main"><header><a href="/." class="logo">gzmviavia</a><ul class="nav"><li class="nav-link"><a href="/" target="_self">首页</a></li><li class="nav-link"><a href="/archives/" target="_self">归档</a></li><li class="nav-link"><a href="/categories/" target="_self">分类</a></li><li class="nav-link"><a href="/tags/" target="_self">标签</a></li><li class="nav-link"><a href="/about/" target="_self">关于</a></li></ul></header><section id="container"><article class="post"><h1 class="post-title">传输控制协议（2）可靠传输</h1><span class="post-time">2016年8月11日</span><div id="sidebar" class="post-sidebar"><h3 class="heading">目录</h3><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#TCP如何保证可靠传输"><span class="toc-text">TCP如何保证可靠传输</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#超时重传"><span class="toc-text">超时重传</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#停止等待ARQ协议"><span class="toc-text">停止等待ARQ协议</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#回退n帧ARQ协议"><span class="toc-text">回退n帧ARQ协议</span></a></li></ol></li><li class="toc-item toc-level-2"><a class="toc-link" href="#流量控制"><span class="toc-text">流量控制</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#流量控制的原理"><span class="toc-text">流量控制的原理</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#流量控制所引发的问题"><span class="toc-text">流量控制所引发的问题</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#Nagle算法"><span class="toc-text">Nagle算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#延迟确认算法"><span class="toc-text">延迟确认算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#Nagle算法与延迟确认算法所引起的后果"><span class="toc-text">Nagle算法与延迟确认算法所引起的后果</span></a></li></ol></li></ol></div><div class="post-content"><h2 id="TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;"><a href="#TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;" class="headerlink" title="TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;"></a>TCP&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;</h2><p>&#x8981;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x4FDD;&#x8BC1;&#x4E0B;&#x9762;&#x8FD9;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x6210;&#x7ACB;</p>
<ol>
<li>&#x4F20;&#x8F93;&#x4FE1;&#x9053;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5DEE;&#x9519;</li>
<li>&#x4E0D;&#x7BA1;&#x53D1;&#x9001;&#x65B9;&#x4EE5;&#x591A;&#x5FEB;&#x7684;&#x901F;&#x7387;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x603B;&#x662F;&#x6765;&#x5F97;&#x5373;&#x5904;&#x7406;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x3002;</li>
</ol>
<a id="more"></a>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x662F;&#x4E0D;&#x4F1A;&#x6210;&#x7ACB;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x534F;&#x8BAE;&#xFF0C;&#x4F7F;&#x5F97;</p>
<ol>
<li>&#x5F53;&#x51FA;&#x73B0;&#x5DEE;&#x9519;&#x65F6;&#xFF0C;&#x8BA9;&#x53D1;&#x9001;&#x65B9;&#x91CD;&#x4F20;&#x51FA;&#x73B0;&#x5DEE;&#x9519;&#x7684;&#x6570;&#x636E;&#x3002; &#x7B80;&#x5355;&#x5F97;&#x6765;&#x8BF4;&#x5C31;&#x662F;<strong>&#x8D85;&#x65F6;&#x91CD;&#x4F20;</strong>&#x3002;</li>
<li>&#x63A5;&#x6536;&#x65B9;&#x6765;&#x4E0D;&#x53CA;&#x5904;&#x7406;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53CA;&#x65F6;&#x544A;&#x8BC9;&#x53D1;&#x9001;&#x65B9;&#x9002;&#x5F53;&#x964D;&#x4F4E;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#x3002;  &#x7B80;&#x5355;&#x5F97;&#x6765;&#x8BF4;&#x5C31;&#x662F;<strong>&#x6D41;&#x91CF;&#x63A7;&#x5236;</strong>&#x3002;</li>
</ol>
<h2 id="&#x8D85;&#x65F6;&#x91CD;&#x4F20;"><a href="#&#x8D85;&#x65F6;&#x91CD;&#x4F20;" class="headerlink" title="&#x8D85;&#x65F6;&#x91CD;&#x4F20;"></a>&#x8D85;&#x65F6;&#x91CD;&#x4F20;</h2><p>TCP&#x8981;&#x6C42;&#x63A5;&#x6536;&#x65B9;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x3002;<br>TCP&#x4F1A;&#x5BF9;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x7684;&#x5206;&#x7EC4;&#x542F;&#x52A8;&#x4E00;&#x4E2A;<strong>&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;</strong>&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x5230;&#x671F;&#x4E4B;&#x524D;&#x6536;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x64A4;&#x9500;&#x8BA1;&#x65F6;&#x5668;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x5230;&#x671F;&#x4E4B;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5C31;&#x4F1A;&#x91CD;&#x53D1;&#x8BE5;&#x5206;&#x7EC4;&#x3002;&#x6240;&#x4EE5;</p>
<ul>
<li>&#x53D1;&#x9001;&#x65B9;&#x5FC5;&#x987B;&#x4FDD;&#x7559;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x5206;&#x7EC4;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x76F4;&#x5230;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x53D1;&#x6765;&#x7684;&#x5BF9;&#x4E8E;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x624D;&#x80FD;&#x591F;&#x4E22;&#x5F03;&#x8BE5;&#x62A5;&#x6587;&#x3002;</li>
<li>&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x8BBE;&#x7F6E;&#x7684;&#x91CD;&#x4F20;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x6BD4;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x7684;<strong>&#x5E73;&#x5747;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;</strong>&#x66F4;&#x957F;&#x4E00;&#x4E9B;&#x3002;&#x8BE5;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x9009;&#x62E9;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B9A;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x81EA;&#x9002;&#x5E94;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x81EA;&#x52A8;&#x91CD;&#x4F20;&#x5206;&#x7EC4;&#x7684;&#x534F;&#x8BAE;&#x6210;&#x4E3A;ARQ(Automatic Repeat reQuset)&#x534F;&#x8BAE;&#xFF0C;&#x5373;&#x63A5;&#x6536;&#x65B9;&#x4E0D;&#x7528;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x65B9;&#x91CD;&#x4F20;&#x67D0;&#x4E2A;&#x51FA;&#x9519;&#x7684;&#x5206;&#x7EC4;&#x3002;</p>
<p><strong>ARP&#x534F;&#x8BAE;&#x5206;&#x4E3A;&#x505C;&#x6B62;&#x7B49;&#x5F85;(stop-and-wait)ARQ&#x3001;&#x56DE;&#x9000;n&#x5E27;(go-back-n)ARQ&#x3001;&#x9009;&#x62E9;&#x6027;&#x91CD;&#x4F20;(selective repeat)ARQ&#x3002;</strong></p>
<p>&#x540E;&#x4E24;&#x79CD;ARQ&#x53C8;&#x53EB;&#x505A;&#x8FDE;&#x7EED;ARQ&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x4E24;&#x79CD;ARQ&#x5141;&#x8BB8;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x8FDE;&#x7EED;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x5206;&#x7EC4;&#x3002;</p>
<h3 id="&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;"><a href="#&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;" class="headerlink" title="&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;"></a>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;</h3><p>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x534F;&#x8BAE;&#x5982;&#x4E0B;&#x56FE;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;A&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x7ED9;B&#xFF0C;&#x5982;&#x679C;A&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;B&#x5BF9;&#x4E8E;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x4F1A;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6536;&#x5230;&#x4E86;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x8BE5;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x91CD;&#x4F20;&#x8BE5;&#x5206;&#x7EC4;&#x3002;</p>
<p><img src="/2016/08/11/transmission-control-protocol2/stop_waitting_protocol.png" alt="&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;"></p>
<p>&#x5982;&#x679C;B&#x6536;&#x5230;&#x4E86;A&#x53D1;&#x9001;&#x7684;&#x62A5;&#x6587;M1&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x9001;&#x4E86;&#x5BF9;M1&#x62A5;&#x6587;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E22;&#x5931;&#x4E86;&#x6216;&#x8005;&#x8FDF;&#x5230;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;</p>
<ul>
<li>&#x786E;&#x8BA4;&#x4E22;&#x5931;&#xFF1A;&#x90A3;&#x4E48;A&#x4F1A;&#x91CD;&#x4F20;&#x62A5;&#x6587;M1&#xFF0C;B&#x63A5;&#x6536;&#x5230;M1&#x540E;&#x5C31;&#x77E5;&#x9053;A&#x6CA1;&#x6709;&#x6536;&#x5230;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x91CD;&#x53D1;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x7684;M1&#x5206;&#x7EC4;&#x3002;</li>
<li>&#x786E;&#x8BA4;&#x8FDF;&#x5230;&#xFF1A;&#x5728;&#x8D85;&#x65F6;&#x8BA1;&#x65F6;&#x5668;&#x7684;&#x671F;&#x9650;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x5BF9;&#x62A5;&#x6587;M1&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;A&#x4F1A;&#x91CD;&#x4F20;&#x62A5;&#x6587;M1&#xFF0C;B&#x63A5;&#x6536;&#x5230;M1&#x540E;&#x5C31;&#x77E5;&#x9053;A&#x6CA1;&#x6709;&#x6536;&#x5230;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x91CD;&#x53D1;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x7684;M1&#x62A5;&#x6587;&#x3002;&#x90A3;&#x4E48;A&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x5230;&#x4E24;&#x4E2A;&#x5BF9;M1&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x90A3;&#x4E48;A&#x53EA;&#x8981;&#x4E22;&#x5F03;&#x91CD;&#x590D;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x5373;&#x53EF;&#x3002;</li>
</ul>
<p><img src="/2016/08/11/transmission-control-protocol2/verify_lost_and_verify_late.png" alt="&#x786E;&#x8BA4;&#x4E22;&#x5931;&#x548C;&#x786E;&#x8BA4;&#x8FDF;&#x5230;"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#x53D1;&#x9001;&#x6548;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD0;&#x8F93;&#x5C42;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E2A;&#x8FD9;&#x662F;&#x5F15;&#x51FA;&#x5982;&#x679C;&#x4FDD;&#x8BC1;&#x6700;&#x7B80;&#x5355;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x8981;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"><a href="#&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;" class="headerlink" title="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"></a>&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;</h3><p>&#x505C;&#x6B62;&#x7B49;&#x5F85;ARQ&#x6BCF;&#x6B21;&#x53EA;&#x80FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#x3002;&#x800C;&#x56DE;&#x9000;n&#x5E27;&#x5141;&#x8BB8;&#x63A5;&#x6536;&#x65B9;&#x6BCF;&#x6B21;&#x53D1;&#x9001;&#x8FDE;&#x7EED;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7684;&#x539F;&#x7406;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#xFF0C;&#x5728;&#x8BE5;&#x7A97;&#x53E3;&#x5185;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x53EF;&#x4EE5;&#x8FDE;&#x7EED;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x6BCF;&#x6536;&#x5230;&#x7A97;&#x53E3;&#x6700;&#x5DE6;&#x8FB9;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x7A97;&#x53E3;&#x5F80;&#x53F3;&#x79FB;&#x52A8;&#x3002;&#x5982;&#x679C;&#x539F;&#x6765;&#x53D1;&#x9001;&#x4E86;&#x8FDE;&#x7EED;&#x7684;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x7B2C;6&#x4E2A;&#x5206;&#x7EC4;&#x4E86;&#x3002;</p>
<p><img src="/2016/08/11/transmission-control-protocol2/go_back_n.png" alt="&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;"></p>
<p>&#x63A5;&#x6536;&#x65B9;&#x4E00;&#x822C;&#x662F;&#x91C7;&#x7528;<strong>&#x7D2F;&#x79EF;&#x786E;&#x8BA4;</strong>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x63A5;&#x6536;&#x65B9;&#x6CA1;&#x5FC5;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x63A5;&#x6536;&#x5230;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x6536;&#x5230;&#x51E0;&#x4E2A;&#x5206;&#x7EC4;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x6309;&#x5E8F;&#x5230;&#x8FBE;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#x3002;&#x8FD9;&#x5C31;&#x8868;&#x793A;&#x5230;&#x8FD9;&#x4E2A;&#x5206;&#x7EC4;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x6B63;&#x786E;&#x6536;&#x5230;&#x4E86;&#x3002;</p>
<p><strong>&#x7D2F;&#x79EF;&#x786E;&#x8BA4;</strong>&#x4E5F;&#x662F;&#x6709;&#x7F3A;&#x70B9;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x9001;&#x65B9;&#x53D1;&#x9001;&#x4E86;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x95F4;&#x7684;&#x7B2C;3&#x4E2A;&#x5206;&#x7EC4;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x6536;&#x65B9;&#x53EA;&#x80FD;&#x5BF9;&#x7B2C;2&#x4E2A;&#x5206;&#x7EC4;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x8868;&#x793A;&#x7B2C;1&#x4E2A;&#x548C;&#x7B2C;2&#x4E2A;&#x5206;&#x7EC4;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x3002;&#x6B64;&#x65F6;&#x867D;&#x7136;&#x63A5;&#x6536;&#x65B9;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x7B2C;4&#x4E2A;&#x548C;&#x7B2C;5&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x9001;&#x65B9;&#x4ECD;&#x65E7;&#x4F1A;&#x91CD;&#x4F20;&#x7B2C;3&#x3001;4&#x3001;5&#x4E2A;&#x5206;&#x7EC4;&#x3002;&#x8FD9;&#x5C31;&#x53EB;&#x505A;go-back-n&#xFF0C;&#x8868;&#x793A;&#x9700;&#x8981;&#x518D;&#x9000;&#x56DE;&#x6765;&#x91CD;&#x4F20;&#x5DF2;&#x7ECF;&#x53D1;&#x9001;&#x8FC7;&#x7684;n&#x4E2A;&#x5206;&#x7EC4;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;TCP/IP&#x534F;&#x8BAE;&#x597D;&#x50CF;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;"><a href="#&#x6D41;&#x91CF;&#x63A7;&#x5236;" class="headerlink" title="&#x6D41;&#x91CF;&#x63A7;&#x5236;"></a>&#x6D41;&#x91CF;&#x63A7;&#x5236;</h2><p>&#x5728;&#x56DE;&#x9000;n&#x5E27;ARQ&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x8D8A;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x80FD;&#x591F;&#x5728;&#x6536;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#x8FDE;&#x7EED;&#x53D1;&#x9001;&#x66F4;&#x591A;&#x7684;&#x5206;&#x7EC4;&#x3002;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x4F20;&#x8F93;&#x6548;&#x7387;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x53D1;&#x9001;&#x901F;&#x5EA6;&#x8FC7;&#x5FEB;&#xFF0C;&#x5BFC;&#x81F4;&#x63A5;&#x6536;&#x65B9;&#x6765;&#x4E0D;&#x53CA;&#x63A5;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F46;&#x6CA1;&#x6709;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x4F1A;&#x6D6A;&#x8D39;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF0C;&#x5373;&#x8BA9;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x53D1;&#x9001;&#x901F;&#x7387;&#x4E0D;&#x8981;&#x592A;&#x5FEB;&#xFF0C;&#x8981;&#x8BA9;&#x63A5;&#x6536;&#x65B9;&#x6765;&#x7684;&#x53CA;&#x63A5;&#x6536;&#x3002;</p>
<h3 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x539F;&#x7406;"><a href="#&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x539F;&#x7406;" class="headerlink" title="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x539F;&#x7406;"></a>&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x539F;&#x7406;</h3><p>&#x6240;&#x4EE5;&#x53D1;&#x9001;&#x65B9;&#x4E0E;&#x63A5;&#x6536;&#x65B9;&#x8981;&#x5728;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x65F6;&#x534F;&#x5546;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x901A;&#x4FE1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x8981;&#x65F6;&#x523B;&#x8C03;&#x6574;&#x53CC;&#x65B9;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x53D1;&#x7AEF;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x6536;&#x7AEF;&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;rwnd&#xFF08;TCP&#x62A5;&#x6587;&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x5B57;&#x6BB5;&#xFF09;&#x548C;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;cwnd&#xFF08;&#x89C1;&#x62E5;&#x585E;&#x63A7;&#x5236;&#xFF09;&#x53D1;&#x7AEF;&#x7A97;&#x53E3;&#x5927;&#x5C0F; = min{ rwnd , cwnd };</p>
<h3 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x95EE;&#x9898;"><a href="#&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x95EE;&#x9898;"></a>&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x95EE;&#x9898;</h3><p>&#x5047;&#x8BBE;B&#x5728;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x7ED9;A&#x65F6;&#xFF0C;&#x5C06;&#x81EA;&#x8EAB;&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;rwnd&#x8C03;&#x6574;&#x4E3A;0&#xFF0C;&#x5373;&#x544A;&#x8BC9;A&#x4E0D;&#x8981;&#x518D;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x6211;&#x6682;&#x65F6;&#x4E0D;&#x60F3;&#x63A5;&#x6536;&#x6570;&#x636E;&#xFF0C;&#x7B49;&#x5230;B&#x60F3;&#x8981;&#x63A5;&#x6536;&#x6570;&#x636E;&#x65F6;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x975E;&#x96F6;&#x7A97;&#x53E3;&#x7684;&#x901A;&#x77E5;&#x7ED9;A&#xFF0C;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x975E;&#x96F6;&#x7A97;&#x53E3;&#x901A;&#x77E5;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x5373;A&#x5728;&#x7B49;&#x5F85;B&#x53D1;&#x9001;&#x975E;&#x96F6;&#x7A97;&#x53E3;&#x901A;&#x77E5;&#xFF0C;&#x800C;B&#x5728;&#x7B49;&#x5F85;A&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;TCP&#x4E3A;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x90FD;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;<strong>&#x575A;&#x5B9A;&#x8BA1;&#x65F6;&#x5668;&#xFF08;Persistence timer&#xFF09;</strong>&#x3002;&#x53EA;&#x8981;TCP&#x8FDE;&#x63A5;&#x7684;&#x4E00;&#x65B9;&#x6536;&#x5230;&#x4E86;&#x96F6;&#x7A97;&#x53E3;&#x901A;&#x77E5;&#xFF0C;&#x5C31;&#x542F;&#x52A8;&#x5468;&#x671F;&#x6027;&#x7684;&#x575A;&#x5B9A;&#x8BA1;&#x65F6;&#x5668;&#xFF0C;&#x8BE5;&#x8BA1;&#x65F6;&#x5668;&#x4F1A;&#x5468;&#x671F;&#x6027;&#x53D1;&#x9001;<strong>&#x96F6;&#x7A97;&#x53E3;&#x63A2;&#x6D4B;&#x62A5;&#x6587;</strong>&#x3002;&#x800C;&#x5BF9;&#x65B9;&#x5C31;&#x4F1A;&#x5728;&#x786E;&#x8BA4;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x51FA;&#x7A97;&#x53E3;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x503C;&#x4E0D;&#x662F;&#x96F6;&#xFF0C;&#x90A3;&#x4E48;&#x6253;&#x7834;&#x4E86;&#x6B7B;&#x9501;&#x7684;&#x50F5;&#x5C40;&#x3002;</p>
<blockquote>
<p><strong>&#x96F6;&#x7A97;&#x53E3;&#x63A2;&#x6D4B;&#x62A5;&#x6587;</strong>&#x643A;&#x5E26;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x4E0D;&#x643A;&#x5E26;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;TCP&#x8FDE;&#x63A5;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x9001;&#x7684;&#x62A5;&#x6587;&#x7684;ACK&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x88AB;&#x7F6E;&#x4E3A;1&#xFF0C;&#x5982;&#x679C;&#x62A5;&#x6587;&#x4E0D;&#x643A;&#x5E26;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x62A5;&#x6587;&#x5C31;&#x662F;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#xFF0C;&#x5BF9;&#x65B9;&#x662F;&#x4E0D;&#x4F1A;&#x5BF9;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x53D1;&#x51FA;&#x786E;&#x8BA4;&#x7684;&#x3002;</p>
</blockquote>
<h3 id="Nagle&#x7B97;&#x6CD5;"><a href="#Nagle&#x7B97;&#x6CD5;" class="headerlink" title="Nagle&#x7B97;&#x6CD5;"></a>Nagle&#x7B97;&#x6CD5;</h3><p>&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9001;&#x5230;TCP&#x7684;&#x53D1;&#x9001;&#x7F13;&#x5B58;(&#x5C31;&#x662F;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x591A;&#x5927;&#xFF0C;&#x7F13;&#x5B58;&#x5C31;&#x591A;&#x5927;&#xFF09;&#x540E;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x7531;TCP&#x6765;&#x63A7;&#x5236;&#x4E86;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5236;&#x6765;&#x63A7;&#x5236;TCP&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x53D1;&#x9001;&#x65F6;&#x673A;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ol>
<li>TCP&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x7B49;&#x4E8E;<strong>&#x6700;&#x5927;&#x62A5;&#x6587;&#x6BB5;MSS</strong>&#xFF0C;&#x53EA;&#x8981;&#x7F13;&#x5B58;&#x4E2D;&#x5B58;&#x653E;&#x7684;&#x6570;&#x636E;&#x8FBE;&#x5230;MSS&#x5B57;&#x8282;&#x65F6;&#xFF0C;&#x5C31;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;TCP&#x62A5;&#x6587;&#x6BB5;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6307;&#x660E;&#x4E86;&#x8981;&#x53D1;&#x9001;&#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x5373;&#x4F7F;&#x7528;TCP&#x7684;<strong>&#x63A8;&#x9001;&#xFF08;push&#xFF09;</strong>&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x79CD;&#x673A;&#x5236;&#x5C31;&#x662F;&#x53D1;&#x9001;&#x65B9;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x8BA1;&#x65F6;&#x5668;&#xFF0C;&#x5F53;&#x8BA1;&#x65F6;&#x5668;&#x5230;&#x671F;&#x4E86;&#x5C31;&#x5C06;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;</li>
</ol>
<p>&#x5728;TCP&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;<strong>Nagle</strong>&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x82E5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x9010;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x9001;&#x5230;TCP&#x7684;&#x53D1;&#x9001;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x5219;&#x53D1;&#x9001;&#x65B9;&#x5148;&#x628A;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5B57;&#x8282;&#x5148;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x628A;&#x540E;&#x9762;&#x5230;&#x8FBE;&#x7684;&#x6570;&#x636E;&#x5B57;&#x8282;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x5F53;&#x53D1;&#x9001;&#x65B9;&#x6536;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x786E;&#x8BA4;&#x65F6;&#xFF0C;&#x518D;&#x5C06;&#x53D1;&#x9001;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x7EC4;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x7136;&#x540E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;&#x540C;&#x65F6;&#x5BF9;&#x968F;&#x540E;&#x5230;&#x8FBE;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x6536;&#x5230;&#x524D;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x786E;&#x8BA4;&#x540E;&#x624D;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x3002;</li>
<li>&#x5982;&#x679C;&#x53D1;&#x9001;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x6700;&#x5927;&#x957F;&#x5EA6;&#x65F6;&#xFF0C;&#x5C31;&#x7ACB;&#x5373;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x3002;</li>
</ul>
<p>&#x5177;&#x4F53;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight python"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line"><span class="keyword">if</span> there <span class="keyword">is</span> new data to send: <span class="comment">#&#x5982;&#x679C;&#x6709;&#x65B0;&#x6570;&#x636E;&#x8981;&#x53D1;&#x9001;</span></div><div class="line">  <span class="keyword">if</span> the window size &gt;= MSS <span class="keyword">and</span> available data <span class="keyword">is</span> &gt;= MSS: <span class="comment">#&#x6570;&#x636E;&#x7684;&#x957F;&#x5EA6;&#x8FBE;&#x5230;&#x6700;&#x5927;&#x62A5;&#x6587;&#x6BB5;</span></div><div class="line">    send complete MSS segment now <span class="comment">#&#x53D1;&#x9001;&#x6570;&#x636E;</span></div><div class="line">  <span class="keyword">else</span>:</div><div class="line">    <span class="keyword">if</span> there <span class="keyword">is</span> unconfirmed data still <span class="keyword">in</span> the pipe: <span class="comment">#&#x5982;&#x679C;&#x4ECD;&#x65E7;&#x6709;&#x62A5;&#x6587;&#x6BB5;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x786E;&#x8BA4;</span></div><div class="line">	<span class="comment">#&#x90A3;&#x4E48;&#x5C31;&#x5C06;&#x6570;&#x636E;&#x653E;&#x5165;buffer&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x786E;&#x8BA4;&#x624D;&#x53D1;&#x9001;</span></div><div class="line">      enqueue data <span class="keyword">in</span> the buffer until an acknowledge <span class="keyword">is</span> received </div><div class="line">    <span class="keyword">else</span>:</div><div class="line">      send data immediately <span class="comment">#&#x7ACB;&#x5373;&#x53D1;&#x9001;&#x6570;&#x636E;</span></div></pre></td></tr></table></figure></p>
<p>&#x4F7F;&#x7528;Nagle&#x7B97;&#x6CD5;&#x867D;&#x7136;&#x63D0;&#x9AD8;&#x4E86;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x964D;&#x4F4E;&#x4E86;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x5B9E;&#x65F6;&#x6027;&#xFF0C;&#x8FD9;&#x5BF9;&#x5177;&#x6709;&#x5F88;&#x5F3A;&#x5B9E;&#x65F6;&#x6027;&#x7684;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x662F;&#x5F88;&#x4E0D;&#x597D;&#x7684;&#x3002;Nagle&#x7B97;&#x6CD5;&#x662F;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD8;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<strong>TCP_NODELAY</strong>&#x9009;&#x9879;&#x6765;&#x7981;&#x7528;Nagle&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;"><a href="#&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;" class="headerlink" title="&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;"></a>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;</h3><p>TCP&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x4E4B;&#x540E;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x800C;&#x662F;&#x4F1A;&#x5728;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x9001;&#x65F6;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x679C;&#x63A5;&#x6536;&#x65B9;&#x6B64;&#x65F6;&#x8981;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x6570;&#x636E;&#x548C;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x53D1;&#x9001;&#x3002;</li>
<li>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x7684;&#x5EF6;&#x8FDF;&#x8BA1;&#x65F6;&#x5668;&#x8FC7;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x7ACB;&#x5373;&#x53D1;&#x9001;&#x5BF9;&#x8BE5;&#x62A5;&#x6587;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x3002;</li>
</ol>
<p>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x7684;&#x5EF6;&#x8FDF;&#x4E00;&#x822C;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x6700;&#x5C0F;&#x503C;&#x4E3A;<strong>40ms</strong>&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x7ECF;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x53E6;&#x5916;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<strong>TCP_QUICKACK</strong>&#x9009;&#x9879;&#x6765;&#x53D6;&#x6D88;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x3002;</p>
<h3 id="Nagle&#x7B97;&#x6CD5;&#x4E0E;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x540E;&#x679C;"><a href="#Nagle&#x7B97;&#x6CD5;&#x4E0E;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x540E;&#x679C;" class="headerlink" title="Nagle&#x7B97;&#x6CD5;&#x4E0E;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x540E;&#x679C;"></a>Nagle&#x7B97;&#x6CD5;&#x4E0E;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x540E;&#x679C;</h3><p>&#x5982;&#x679C;Nagle&#x7B97;&#x6CD5;&#x548C;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x540C;&#x65F6;&#x5F00;&#x542F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x65F6;&#x5EF6;&#x589E;&#x5927;&#x3002;Nagle&#x7B97;&#x6CD5;&#x8981;&#x6C42;&#x6536;&#x5230;&#x524D;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x7684;ACK&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x80FD;&#x53D1;&#x9001;&#x5176;&#x5B83;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x6240;&#x4EE5;&#x5C3D;&#x7BA1;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x63A5;&#x6536;&#x65B9;&#x56E0;&#x4E3A;&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x6CA1;&#x6709;&#x53D1;&#x9001;&#x5BF9;&#x4E0A;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x8FDF;&#x8FDF;&#x4E0D;&#x80FD;&#x53D1;&#x9001;&#x3002;<br><br><br>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="http://blog.csdn.net/jmq_0000/article/details/7299910" target="_blank" rel="external">ARQ&#x4E0E;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;</a></li>
<li><a href="http://www.tuicool.com/articles/bQfmUv" target="_blank" rel="external">TCP&#x534F;&#x8BAE;&#x4E2D;&#x7684;&#x8BA1;&#x65F6;&#x5668;</a></li>
<li><a href="https://en.wikipedia.org/wiki/Nagle%27s_algorithm" target="_blank" rel="external">Nagle&#x2019;s algorithm</a></li>
<li><a href="http://blog.csdn.net/m_vptr/article/details/7093553" target="_blank" rel="external"> TCP/IP&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;&#x548C;Nagle&#x7B97;&#x6CD5;</a></li>
<li><a href="http://blog.csdn.net/cylan_jia/article/details/7976051" target="_blank" rel="external">Nagle&#x7B97;&#x6CD5;</a></li>
<li><a href="http://blog.csdn.net/dog250/article/details/21303679" target="_blank" rel="external">&#x518D;&#x6B21;&#x8C08;&#x8C08;TCP&#x7684;Nagle&#x7B97;&#x6CD5;&#x4E0E;TCP_CORK&#x9009;&#x9879;</a></li>
</ul>
</div></article><div class="tags"><a href="/tags/运输层/">运输层</a><a href="/tags/TCP/">TCP</a></div><div class="paginator"><a href="/2016/08/12/transmission-control-protocol3/" class="prev"><i class="iconfont icon-left"></i><span> 上一页</span></a><a href="/2016/08/10/transmission-control-protocol1/" class="next"><span>下一页</span><i class="iconfont icon-right"></i></a></div><section id="comments"><div id="disqus_thread"></div></section><script type="text/javascript">(function() {
var d = document, s = d.createElement('script');

s.src = '//ahonn.disqus.com/embed.js';

s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script></section><footer><div class="copyright"><p>&copy;2016<span class="heart"><i class="iconfont icon-heart"></i></span><span class="author">gzmviavia</span></p><p class="theme">Theme by <a href="https://github.com/ahonn/hexo-theme-even"> Even</a></p></div><label id="back2top"><i class="iconfont icon-up"></i></label></footer></div></body><script src="/js/zepto.min.js"></script><script src="/js/theme.js"></script></html>