<!DOCTYPE html><html lang="zh-cn"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="description" content="this is a blog"><meta name="viewport" content="width=device-width, initial-scale=1"><title>传输控制协议（1） · gzmviavia</title><link rel="short icon" href="/favicon.ico"><!-- font--><link rel="stylesheet" href="//fonts.googleapis.com/css?family=Source+Sans+Pro:400,600|Roboto Mono"><!-- icon--><link rel="stylesheet" href="/fonts/iconfont/iconfont.css"><!-- theme style--><link rel="stylesheet" href="/css/style.css"><!-- baidu analytics--><script type="text/javascript">var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?9e0cbea7d3319c6c94c71dfb93c151b8";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script><!-- google analytics--><script type="text/javascript">(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74273646-1', 'auto');
ga('send', 'pageview');</script></head><body><div id="main"><header><a href="/." class="logo">gzmviavia</a><ul class="nav"><li class="nav-link"><a href="/" target="_self">首页</a></li><li class="nav-link"><a href="/archives/" target="_self">归档</a></li><li class="nav-link"><a href="/categories/" target="_self">分类</a></li><li class="nav-link"><a href="/tags/" target="_self">标签</a></li><li class="nav-link"><a href="/about/" target="_self">关于</a></li></ul></header><section id="container"><article class="post"><h1 class="post-title">传输控制协议（1）</h1><span class="post-time">2016年8月9日</span><div id="sidebar" class="post-sidebar"><h3 class="heading">目录</h3><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#TCP首部字段"><span class="toc-text">TCP首部字段</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#TCP连接的建立"><span class="toc-text">TCP连接的建立</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#TCP连接的释放"><span class="toc-text">TCP连接的释放</span></a></li></ol></div><div class="post-content"><h2 id="TCP&#x9996;&#x90E8;&#x5B57;&#x6BB5;"><a href="#TCP&#x9996;&#x90E8;&#x5B57;&#x6BB5;" class="headerlink" title="TCP&#x9996;&#x90E8;&#x5B57;&#x6BB5;"></a>TCP&#x9996;&#x90E8;&#x5B57;&#x6BB5;</h2><p><img src="/2016/08/09/transmission-control-protocol1/TCP_header.png" alt="TCP&#x9996;&#x90E8;&#x5B57;&#x6BB5;"></p>
<ul>
<li><p>16&#x4F4D;&#x6E90;&#x7AEF;&#x53E3;&#xFF1A;&#x7528;&#x6765;&#x5B9E;&#x73B0;TCP&#x7684;&#x5206;&#x7528;&#xFF0C;&#x6839;&#x636E;&#x7AEF;&#x53E3;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4E0A;&#x4EA4;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x4E0A;&#x5C42;&#x5E94;&#x7528;&#x3002;</p>
</li>
<li><p>16&#x4F4D;&#x76EE;&#x7684;&#x7AEF;&#x53E3;&#xFF1A;&#x540C;&#x4E0A;&#x3002;</p>
</li>
<li><p>32&#x4F4D;&#x5E8F;&#x53F7;&#xFF1A;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x53F7;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x90FD;&#x8981;&#x6D88;&#x8017;&#x4E00;&#x4E2A;&#x7684;&#x7F16;&#x53F7;,&#x7F16;&#x53F7;&#x7684;&#x8303;&#x56F4;&#x662F;[0, 2^32-1]&#xFF0C;&#x7F16;&#x53F7;&#x589E;&#x52A0;&#x5230;2^32-1&#x540E;&#xFF0C;&#x7F16;&#x53F7;&#x5C31;&#x4F1A;&#x53D8;&#x6210;0&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3002;&#x9996;&#x90E8;&#x4E2D;&#x5E8F;&#x53F7;&#x8868;&#x793A;&#x8BE5;&#x6B21;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x6BD4;&#x5982;&#x7B2C;&#x4E00;&#x6B21;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E86;100&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x7F16;&#x53F7;&#x662F;[0&#xFF0C;99]&#xFF0C;&#x6240;&#x4EE5;&#x9996;&#x90E8;&#x4E2D;&#x5E8F;&#x53F7;&#x5E94;&#x8BE5;&#x586B;&#x5199;0&#xFF1B;&#x7B2C;&#x4E8C;&#x6B21;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E86;100&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x7F16;&#x53F7;&#x662F;[100,199]&#xFF0C;&#x6240;&#x4EE5;&#x9996;&#x90E8;&#x4E2D;&#x5E8F;&#x53F7;&#x5E94;&#x8BE5;&#x586B;&#x5199;100&#x3002;</p>
</li>
<li><p>32&#x4F4D;&#x786E;&#x8BA4;&#x53F7;&#xFF1A;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x671F;&#x671B;&#x5BF9;&#x65B9;&#x4E0B;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x6570;&#x636E;&#x7684;&#x5E8F;&#x53F7;&#x3002;&#x6BD4;&#x5982;A&#x7B2C;&#x4E00;&#x6B21;&#x4F20;&#x8F93;&#x4E86;100&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x7ED9;B&#xFF0C;&#x90A3;&#x4E48;B&#x5BF9;&#x5176;&#x786E;&#x8BA4;&#x65F6;&#xFF0C;&#x786E;&#x8BA4;&#x53F7;&#x4E3A;100&#xFF0C;&#x8868;&#x660E;&#x5E8F;&#x53F7;100&#x4EE5;&#x524D;&#x7684;&#x6570;&#x636E;&#x6211;&#x90FD;&#x6536;&#x5230;&#x4E86;&#xFF0C;B&#x671F;&#x671B;&#x6536;&#x5230;A&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x5E8F;&#x53F7;&#x662F;100&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x786E;&#x8BA4;&#x53F7; = N&#xFF0C;&#x5219;&#x8868;&#x660E;&#x5230;&#x5E8F;&#x53F7;N - 1&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x6B63;&#x786E;&#x6536;&#x5230;&#x3002;</p>
</blockquote>
</li>
<li><p>4&#x4F4D;&#x9996;&#x90E8;&#x957F;&#x5EA6;&#xFF1A;4&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x80FD;&#x591F;&#x8868;&#x793A;&#x7684;&#x6700;&#x5927;&#x6570;&#x662F;15&#xFF0C;&#x800C;&#x9996;&#x90E8;&#x957F;&#x5EA6;&#x7684;&#x5355;&#x4F4D;&#x662F;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x9996;&#x90E8;&#x957F;&#x5EA6;&#x6700;&#x5927;&#x503C;&#x662F;60&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x9009;&#x9879;&#x957F;&#x5EA6;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;40&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
</li>
<li><p>6&#x4F4D;&#x4FDD;&#x7559;&#xFF1A;&#x4FDD;&#x7559;&#x5B57;&#x6BB5;&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x7F6E;&#x4E3A;0&#x3002;&#x786E;&#x5B9A;&#x6709;&#x4FDD;&#x7559;&#x5B57;&#x6BB5;&#xFF0C;&#x6269;&#x5C55;&#x6027;&#x5C31;&#x53D8;&#x5F3A;&#x4E86;&#x3002;</p>
</li>
<li><p>1&#x4F4D;URG&#xFF1A;</p>
</li>
<li><p>1&#x4F4D;ACK&#xFF1A;&#x5F53;ACK = 1&#x65F6;&#xFF0C;&#x786E;&#x8BA4;&#x53F7;&#x5B57;&#x6BB5;&#x624D;&#x6709;&#x6548;&#xFF0C;&#x5F53;ACK = 0&#x65F6;&#xFF0C;&#x786E;&#x8BA4;&#x53F7;&#x65E0;&#x6548;&#x3002;TCP&#x89C4;&#x5B9A;&#xFF0C;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x4F20;&#x9001;&#x7684;&#x62A5;&#x6587;&#x90FD;&#x5FC5;&#x987B;&#x628A;ACK&#x7F6E;&#x4E3A;1&#x3002;</p>
</li>
<li><p>1&#x4F4D;PSH&#xFF1A;</p>
</li>
<li><p>1&#x4F4D;RST&#xFF1A;</p>
</li>
<li><p>1&#x4F4D;SYN&#xFF1A;&#x5F53;SYN = 1&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x62A5;&#x6587;&#x662F;&#x4E0E;&#x5EFA;&#x7ACB;TCP&#x8FDE;&#x63A5;&#x6709;&#x5173;&#x7684;&#x62A5;&#x6587;&#x3002;</p>
</li>
<li><p>1&#x4F4D;FIN&#xFF1A;&#x5F53;FIN = 1&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x62A5;&#x6587;&#x662F;&#x4E0E;&#x91CA;&#x653E;TCP&#x8FDE;&#x63A5;&#x6709;&#x5173;&#x7684;&#x62A5;&#x6587;&#x3002;</p>
</li>
<li><p>16&#x4F4D;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#xFF1A;&#x7A97;&#x53E3;&#x5B57;&#x6BB5;&#x6307;&#x51FA;&#x4E86;&#x73B0;&#x5728;&#x5141;&#x8BB8;&#x5BF9;&#x65B9;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3002;&#x7A97;&#x53E3;&#x503C;&#x7ECF;&#x5E38;&#x5728;&#x52A8;&#x6001;&#x53D8;&#x5316;&#x7740;&#x3002;</p>
</li>
<li><p>16&#x4F4D;&#x68C0;&#x9A8C;&#x548C;&#xFF1A;&#x5BF9;&#x4F2A;&#x9996;&#x90E8; + TCP&#x9996;&#x90E8; + &#x6570;&#x636E;&#x90E8;&#x5206;&#x8FDB;&#x884C;16&#x4F4D;&#x53CD;&#x7801;&#x6C42;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x53CD;&#x7684;&#x7ED3;&#x679C;&#x586B;&#x5199;&#x5728;&#x8BE5;&#x5B57;&#x6BB5;&#x3002;&#x63A5;&#x6536;&#x65B9;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x540C;&#x6837;&#x8FDB;&#x884C;&#x4F2A;&#x9996;&#x90E8; + TCP&#x9996;&#x90E8; + &#x6570;&#x636E;&#x90E8;&#x5206;&#x7684;16&#x4F2A;&#x53CD;&#x7801;&#x6C42;&#x548C;&#xFF0C;&#x5982;&#x679C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x90FD;&#x662F;1&#x8868;&#x9762;&#x6570;&#x636E;&#x5728;&#x4F20;&#x8F93;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;</p>
</li>
<li><p>16&#x4F4D;&#x7D27;&#x6025;&#x6307;&#x9488;&#xFF1A;</p>
</li>
<li><p>&#x9009;&#x9879;&#xFF1A;</p>
<h2 id="TCP&#x8FDE;&#x63A5;&#x7684;&#x5EFA;&#x7ACB;"><a href="#TCP&#x8FDE;&#x63A5;&#x7684;&#x5EFA;&#x7ACB;" class="headerlink" title="TCP&#x8FDE;&#x63A5;&#x7684;&#x5EFA;&#x7ACB;"></a>TCP&#x8FDE;&#x63A5;&#x7684;&#x5EFA;&#x7ACB;</h2></li>
</ul>
<blockquote>
<p>how are you ?        &#xA0;&#xA0;&#xA0;&#xA0;(SYN)<br>fine.And you?        &#xA0;&#xA0;&#xA0;&#xA0;(SYN + ACK)<br>Fine.                &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;(ACK)</p>
</blockquote>
<p><img src="/2016/08/09/transmission-control-protocol1/TCP_three_shake_hands.png" alt="&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x6D41;&#x7A0B;&#x56FE;"></p>
<ol>
<li><p>&#x5BA2;&#x6237;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8BE5;&#x62A5;&#x6587;&#x7684;SYN = 1&#xFF0C;seq = x&#x3002;&#x8868;&#x660E;&#x8FD9;&#x662F;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x7684;&#x62A5;&#x6587;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x643A;&#x5E26;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6D88;&#x8017;&#x4E00;&#x4E2A;&#x5E8F;&#x53F7;&#x3002;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x8BE5;&#x62A5;&#x6587;&#x4E4B;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x7684;&#x62A5;&#x6587;&#xFF0C;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x7ED9;&#x5BA2;&#x670D;&#xFF0C;&#x8BE5;&#x62A5;&#x6587;&#x7684;SYN = 1&#xFF0C;ACK = 1&#xFF0C;seq = y&#xFF0C;ack_num = x + 1&#x3002;&#x8868;&#x660E;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x643A;&#x5E26;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6D88;&#x8017;&#x4E00;&#x4E2A;&#x5E8F;&#x53F7;&#x3002;</p>
</li>
<li><p>&#x5BA2;&#x6237;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x4E4B;&#x540E;&#xFF0C;&#x4E5F;&#x8981;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x62A5;&#x6587;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8BE5;&#x62A5;&#x6587;&#x7684;&#x7684;ACK = 1&#xFF0C;seq = x + 1&#xFF0C;ack_num = y + 1&#x3002;&#x4E5F;&#x5C31;&#x4F60;&#x8BA4;&#x4E3A;&#x4E0A;&#x9762;&#x4E24;&#x6B65;&#x5DF2;&#x7ECF;&#x591F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x53EA;&#x6709;&#x4E00;&#x4E2A;ACK&#x5B57;&#x6BB5;&#x7F6E;&#x4E3A;1&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7EAF;&#x7CB9;&#x7684;&#x786E;&#x8BA4;&#x5305;&#xFF0C;TCP&#x89C4;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x786E;&#x8BA4;&#x5305;&#x4E0D;&#x643A;&#x5E26;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x6D88;&#x8017;&#x5E8F;&#x53F7;&#x3002;</p>
</li>
</ol>
<p><br><br><strong>&#x5173;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x8C22;&#x5E0C;&#x4EC1;&#x7684;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x300B;&#x8BF4;&#xFF1A;&#x9632;&#x6B62; &#x5DF2;&#x5931;&#x6548;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x7A81;&#x7136;&#x53C8;&#x4F20;&#x7ED9;server</strong></p>
<blockquote>
<p>&#x201C;&#x5DF2;&#x5931;&#x6548;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x201D;&#x7684;&#x4EA7;&#x751F;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;client&#x53D1;&#x51FA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x5E76;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x67D0;&#x4E2A;&#x7F51;&#x7EDC;&#x7ED3;&#x70B9;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x6EDE;&#x7559;&#x4E86;&#xFF0C;&#x4EE5;&#x81F4;&#x5EF6;&#x8BEF;&#x5230;&#x8FDE;&#x63A5;&#x91CA;&#x653E;&#x4EE5;&#x540E;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x624D;&#x5230;&#x8FBE;server&#x3002;&#x672C;&#x6765;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x65E9;&#x5DF2;&#x5931;&#x6548;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#x3002;&#x4F46;server&#x6536;&#x5230;&#x6B64;&#x5931;&#x6548;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x540E;&#xFF0C;&#x5C31;&#x8BEF;&#x8BA4;&#x4E3A;&#x662F;client&#x518D;&#x6B21;&#x53D1;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x5411;client&#x53D1;&#x51FA;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x540C;&#x610F;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x5047;&#x8BBE;&#x4E0D;&#x91C7;&#x7528;&#x201C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x8981;server&#x53D1;&#x51FA;&#x786E;&#x8BA4;&#xFF0C;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#x5C31;&#x5EFA;&#x7ACB;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x5728;client&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x51FA;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x7406;&#x776C;server&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5411;server&#x53D1;&#x9001;ack&#x5305;&#x3002;&#xFF08;&#x6B64;&#x65F6;&#x56E0;&#x4E3A;client&#x6CA1;&#x6709;&#x53D1;&#x8D77;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;client&#x5904;&#x4E8E;CLOSED&#x72B6;&#x6001;&#xFF0C;&#x63A5;&#x53D7;&#x5230;&#x4EFB;&#x4F55;&#x5305;&#x90FD;&#x4F1A;&#x4E22;&#x5F03;&#xFF0C;&#x8C22;&#x5E0C;&#x4EC1;&#x4E3E;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#xFF09;&#x4F46;server&#x5374;&#x4EE5;&#x4E3A;&#x65B0;&#x7684;&#x8FD0;&#x8F93;&#x8FDE;&#x63A5;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#xFF0C;&#x5E76;&#x4E00;&#x76F4;&#x7B49;&#x5F85;client&#x53D1;&#x6765;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#xFF0C;server&#x7684;&#x5F88;&#x591A;&#x8D44;&#x6E90;&#x5C31;&#x767D;&#x767D;&#x6D6A;&#x8D39;&#x6389;&#x4E86;&#x3002;&#x91C7;&#x7528;&#x201C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4E0A;&#x8FF0;&#x73B0;&#x8C61;&#x53D1;&#x751F;&#x3002;&#x4F8B;&#x5982;&#x521A;&#x624D;&#x90A3;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;client&#x4E0D;&#x4F1A;&#x5411;server&#x7684;&#x786E;&#x8BA4;&#x53D1;&#x51FA;&#x786E;&#x8BA4;&#x3002;server&#x7531;&#x4E8E;&#x6536;&#x4E0D;&#x5230;&#x786E;&#x8BA4;&#xFF0C;&#x5C31;&#x77E5;&#x9053;client&#x5E76;&#x6CA1;&#x6709;&#x8981;&#x6C42;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;</p>
</blockquote>
<h2 id="TCP&#x8FDE;&#x63A5;&#x7684;&#x91CA;&#x653E;"><a href="#TCP&#x8FDE;&#x63A5;&#x7684;&#x91CA;&#x653E;" class="headerlink" title="TCP&#x8FDE;&#x63A5;&#x7684;&#x91CA;&#x653E;"></a>TCP&#x8FDE;&#x63A5;&#x7684;&#x91CA;&#x653E;</h2><p><img src="/2016/08/09/transmission-control-protocol1/TCP_four_shake_hands.png" alt="TCP&#x56DB;&#x6B21;&#x6325;&#x624B;&#x6D41;&#x7A0B;"></p>
<p>TCP&#x91CA;&#x653E;&#x8FDE;&#x63A5;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x56DB;&#x6B21;&#x6325;&#x624B;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;TCP&#x662F;&#x5168;&#x53CC;&#x5DE5;&#x7684;&#xFF0C;&#x4E5F;&#x5373;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;A&#x53EF;&#x4EE5;&#x7ED9;B&#x4F20;&#x6570;&#x636E;&#xFF0C;B&#x4E5F;&#x53EF;&#x4EE5;&#x7ED9;A&#x4F20;&#x6570;&#x636E;&#x3002;A&#x4F20;&#x5B8C;&#x6570;&#x636E;&#x60F3;&#x8981;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;B&#x4E5F;&#x4F20;&#x5B8C;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x8981;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x4EE5;A-&gt;B&#x65B9;&#x5411;&#x7684;&#x8FDE;&#x63A5;&#x548C;B-&gt;A&#x65B9;&#x5411;&#x7684;&#x8FDE;&#x63A5;&#x9700;&#x8981;&#x5206;&#x522B;&#x5355;&#x72EC;&#x5173;&#x95ED;&#x3002;&#x6BCF;&#x4E2A;&#x65B9;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x5173;&#x95ED;&#x9700;&#x8981;&#x4E24;&#x6B21;&#x6325;&#x624B;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x56DB;&#x6B21;&#x6325;&#x624B;&#x3002;</p>
</div></article><div class="tags"><a href="/tags/运输层/">运输层</a><a href="/tags/TCP/">TCP</a></div><div class="paginator"><a href="/2016/08/09/transmission-control-protocol2/" class="prev"><i class="iconfont icon-left"></i><span> 上一页</span></a><a href="/2016/08/09/user-datagram-protocol/" class="next"><span>下一页</span><i class="iconfont icon-right"></i></a></div><section id="comments"><div id="disqus_thread"></div></section><script type="text/javascript">(function() {
var d = document, s = d.createElement('script');

s.src = '//ahonn.disqus.com/embed.js';

s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script></section><footer><div class="copyright"><p>&copy;2016<span class="heart"><i class="iconfont icon-heart"></i></span><span class="author">gzmviavia</span></p><p class="theme">Theme by <a href="https://github.com/ahonn/hexo-theme-even"> Even</a></p></div><label id="back2top"><i class="iconfont icon-up"></i></label></footer></div></body><script src="/js/zepto.min.js"></script><script src="/js/theme.js"></script></html>